#include<stdio.h>
int main(){
        char x, y;
        printf("Մուտքագրեք 2 սիմվոլ\n");
        scanf("%c %c", &x, &y);
       if (x >= 65 && x <= 90 )
       {
         if (y == x + 32)
         {
                printf("սիմվոլները արտահայտում են նույն տառի մեծատառ և փոքրատառ տեսքերը\n");
         }       
       }
       if (y >= 65 && y <= 90 )
       {
         if (x == y + 32)
         {
                printf("սիմվոլները արտահայտում են նույն տառի մեծատառ և փոքրատառ տեսքերը\n");
         }
                 
       }
        return 0;       
}