#include<stdio.h>
int main(){
        int x;
        int y;
        char op;

        printf("Մուտքագրեք, թե ինչ գործողություն եք ցանկանում կատարել։ +, -, *, / \n");
        scanf("%c", &op);
        while (op != 'Q'){
                printf("Մուտքագրեք առաջին թիվը\n");
                scanf("%d", &x);
                printf("Մուտքագրեք երկրորդ թիվը \n");
                scanf("%d", &y);

                switch (op)
                {
                case '+':
                        printf("Գումարման արդյունքում կստացվի %d \n", x + y);
                        break;
                case '-':
                        printf("Հանման արդյունքում կստացվի %d \n", x - y);
                        break;
                case '*':
                        printf("Բազմապատկման արդյունքում կստացվի %d \n", x * y);
                        break;
                case '/':
                        if (y == 0)
                        {
                               printf("Թիվը 0֊ի վրա չի բաժանվում\n");
                        }
                        else
                        {
                                printf("Բաժանման արդյունքում կստացվի  %d \n", x / y);
                        }
                        break;

                default:
                        printf("Սխալ մուտքագրում \n");
                }
                printf("ծրագրից դուրս գալու համար մուտքագրեք Q,  եթե ցանկանում եք շարունակել նորից մուտքագրեք թե ինչ գործողություն եք ցանկանում կատարե:  +, -, *, /  \n");

        scanf(" %c", &op);

        }
}